final List<List<dynamic>> surveyData = [
  [
    '혈관 및 혈액 순환',
    '혈관 및 혈액 순환에 겪고 있는\n증상을 모두 선택해 주세요.',
    [
      '얼굴이 자주 창백해져요',
      '잇몸이 붓고 피가 나요',
      '손발 끝이 자주 저려요',
      '상처가 잘 낫지 않아요',
      '해당 사항은 없지만 앞으로가 걱정돼요'
    ]
  ],
  [
    '소화 및 장',
    '소화 및 장에 겪고 있는\n증상을 모두 선택해 주세요.',
    [
      '술을 마시면 얼굴이나 몸이 붉어지고 소화가 안돼요',
      '변이 묽은 편이에요',
      '변비가 있어요',
      '복통이나 속쓰림이 자주 발생해요',
      '해당 사항은 없지만 앞으로가 걱정돼요'
    ]
  ],
  [
    '피부 건강',
    '피부에 겪고 있는\n증상을 모두 선택해 주세요.',
    [
      '여드름이 많아서 걱정이에요',
      '피부에 염증이 자주 생겨요',
      '건조한 피부에요',
      '피부에 기름이 많이 생겨요',
      '머리에 비듬이 많이 생겨요',
      '6해당 사항은 없지만 앞으로가 걱정돼요'
    ]
  ],
  [
    '눈',
    '눈에 겪고 있는\n증상을 모두 선택해 주세요.',
    [
      '눈이 건조하고 뻑뻑해요',
      '눈 주면이 떨려요',
      '핸드폰, 모니터를 자주 봐 시야가 흐려졌어요',
      '어두워지면 시력이 저하돼요',
      '해당 사항은 없지만 앞으로가 걱정돼요'
    ]
  ],
  [
    '두뇌 건강',
    '두뇌 건강에 겪고 있는\n증상을 모두 선택해 주세요.',
    [
      '기억력이 떨어졌음을 느껴요',
      '두통이 자주 생겨요',
      '불안함과 긴장감을 느껴요',
      '우울한 감정을 느껴요',
      '해당 사항은 없지만 앞으로가 걱정돼요'
    ]
  ],
  [
    '피로감',
    '피로감에 겪고 있는\n증상을 모두 선택해 주세요.',
    [
      '무기력하고 식욕이 없어요',
      '잠을 많이 자도 피곤함이 남아있어요',
      '신경이 예민하고 잠을 잘 이루지 못해요',
      '잠을 너무 오랫동안 자요',
      '소변을 보기 위해 잠을 깨요',
      '6해당 사항은 없지만 앞으로가 걱정돼요'
    ]
  ],
  [
    '관절 및 뼈',
    '관절 및 뼈에 겪고 있는\n증상을 모두 선택해 주세요.',
    [
      '무릎이 시리고 통증을 느껴요',
      '자고 일어나면 걷기가 힘들어요',
      '뼈가 부러진 경험이 있어요',
      '뼈가 약하다고 느끼고 있어요',
      '손목이 저리고 가동범위가 짧아요',
      '6해당 사항은 없지만 앞으로가 걱정돼요'
    ]
  ],
  [
    '면역',
    '면역에 겪고 있는\n증상을 모두 선택해 주세요.',
    [
      '스트레스를 많이 받아요',
      '알레르기 질환이 있어요',
      '감염성 질환에 자주 걸려요',
      '해당 사항은 없지만 앞으로가 걱정돼요'
    ]
  ],
  [
    '모발',
    '모발에 겪고 있는\n증상을 모두 선택해 주세요.',
    [
      '현재 탈모가 진행 중이에요',
      '모발이 점점 가늘어 졌다고 느껴요',
      '새치가 많이 나요',
      '머리카락이 윤기가 없어요',
      '해당 사항은 없지만 앞으로가 걱정돼요'
    ]
  ],
];
